#辞書についての自分の理解が甘いので、よく勉強するように
#辞書について、辞書は、キーと値のセットを複数持つ
"""x={'りんご':150,'バナナ':300,'オレンジ':100}
result=x['バナナ']
print(result)➡300という値が表示されました。"""

#次に、値の変更を行います。
"""x={'りんご':150,'バナナ':300,'オレンジ':100}
x['オレンジ']=120
print(x) ➡{'りんご': 150, 'バナナ': 300, 'オレンジ': 120}が表示されました。"""

#キーと値のセットを追加する
"""x={'りんご':150,'バナナ':300,'オレンジ':100}
x['イチゴ']=500
print(x)　➡{'りんご': 150, 'バナナ': 300, 'オレンジ': 100, 'イチゴ': 500}
            このように追加することが出来ました。"""
#lenについて
"""x={'りんご':150,'バナナ':300,'オレンジ':100}
x_len=len(x)
print(x_len)　➡3という文字が表示されました。"""

