"""x='あいうえお'    #このように文字をx等箱に入れようとするときは''が必要
   print(x)"""
"""x=15000
   print(x)   →　15000という結果が出てきました """


"""x=100
y=59
print(x + y)   ➡159という結果が出てきました"""

#要素について
"""x=['a','b','c',10]
result=x[2]
print(x) ➡cが表示されました。"""

"""
x=['a','b','c',10]
x[1]='B'
print(x) ➡['a', 'B', 'c', 10]が表示されました"""

"""
x=['a','b']
y=['A','B']
result=x+y
print(result)　➡['a', 'b', 'A', 'B']が表示されました"""
#次はインデントの分割について勉強します。

"""x=['a','b','c','d','e']
result=x[1:4]
print(result) ➡['b', 'c', 'd']が表示されました。"""

"""x=['a','b','c','d','e']
result=x[2:5]
print(result)　➡['c', 'd', 'e']"""

#変数の個数を表す関数、lenについて
"""x=['a','b','c','d','e']
x_len=len(x)
print(x_len) ➡5という数字が表示されました。5個の要素があることが分かります。"""

    
